//-------------------------------------------------------
// window
//-------------------------------------------------------
function sayHi() {
    alert("Hello");
}
  // глобальные функции доступны как методы глобального объекта:
  window.sayHi();

  alert(window.innerHeight); // внутренняя высота окна браузера

//   Глобальный объект window имеет огромное количество интересніх и полезніх функций с каробки. 
//-------------------------------------------------------
// DOM
//-------------------------------------------------------
// заменим цвет фона на красный,
document.body.style.background = "red";

// а через секунду вернём как было
setTimeout(() => document.body.style.background = "", 1000);
//-------------------------------------------------------
// BOM
//-------------------------------------------------------
alert(location.href); // показывает текущий URL
if (confirm("Перейти на Wikipedia?")) {
  location.href = "https://wikipedia.org"; // перенаправляет браузер на другой URL
}